Revit 2027 API
Opening.IsTransparentInElevation Property
Indicates if the opening is transparent in elevation view when loaded into the project.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsTransparentInElevation { get; set; }
Public Property IsTransparentInElevation As Boolean
	Get
	Set
public:
property bool IsTransparentInElevation {
	bool get ();
	void set (bool value);
}
member IsTransparentInElevation : bool with get, set
Property Value
Boolean
Exceptions
Exception | Condition
InvalidOperationException |  Thrown when access this property in an opening belonging to a Revit project document.
Remarks
This property is only valid in Revit family documents.
See Also
Reference
Opening Class
Autodesk.Revit.DB Namespace